#/bin/bash

# Переписал программу меню TPUT на языке bash для OS Linux. 
# Нашел цветовые вариации для 128 значений.
# По умолчанию стоит ноль.
# Нужное выбрать и раскомментировать.

 E='echo -e';e='echo -en';trap "R;exit" 2
 ESC=$( $e "\e")
  TPUT(){ $e "\e[${1};${2}H";}
 CLEAR(){ $e "\ec";}
 CIVIS(){ $e "\e[?5l";}
  DRAW(){ $e "\e%@\e(0";}
 WRITE(){ $e "\e(B";}
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
#                                         *** ПРИМЕР ЦВЕТОВЫХ ВАРИАЦИЙ TPUT МЕНЮ ***                                         |              
#~~~~~~~~~~~~~~~~~~~~~~~~+~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+~~~~~~~~~~~~~~~~+~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
# MARK(){ $e "\e[   m";} | ЗАГЛАВИЕ                                         |                | КУРСОР                        |
#                        +~~~~~~~~~~~~~~~~~~~~~~~~~~+~~~~~~~~~~~~~~~~~~~~~~~+~~~~~~~~~~~~~~~~+~~~~~~~~~~~~+~~~~~~~~~~~~~~~~~~+
#                        | Текст                    | Фон                   | Текст списке   | Текст      | Фон              |
#------------------------+--------------------------+-----------------------+----------------+------------+~~~~~~~~~~~~~~~~~~~+
  MARK(){ $e "\e[0m";}  #|        белый             |                       | белый          | белый      |                  |
# MARK(){ $e "\e[1m";}   | жирный/белый             |                       | .....          | .....      | жирный/белый     |
# MARK(){ $e "\e[2m";}   | жирный/серый             |                       | .....          | серый      |                  |
# MARK(){ $e "\e[3m";}   | жирный/белый             | косой шрифт           | .....          | белый      | косой шрифт      |
# MARK(){ $e "\e[4m";}   | ............             |                       | .....          | .....      |                  |
# MARK(){ $e "\e[5m";}   | ............             | мигающий текст        | .....          | .....      | мигающий текст   |
# MARK(){ $e "\e[6m";}   | ............             | ..............        | .....          | .....      | ..............   |
# MARK(){ $e "\e[7m";}   | жирный/чёрный            | белый                 | .....          | чёрный     | белый            |
# MARK(){ $e "\e[8m";}   | чёрный                   |                       | .....          | чёрный     |                  |
# MARK(){ $e "\e[9m";}   | жирный/белый             | перечёркивание        | .....          | белый      | перечёркивание   |
# MARK(){ $e "\e[10m";}  | жирный/белый             |                       | .....          | белый      |                  |
# MARK(){ $e "\e[  m";}  |                          |                       |                |            |                  |
# MARK(){ $e "\e[20m";}  | ............             |                       | .....          | .....      |                  |
# MARK(){ $e "\e[21m";}  | ............             | двойная-подчёркивание | .....          | белый      | двойное          |
# MARK(){ $e "\e[22m";}  | серый                    |                       | .....          | белый      |                  |
# MARK(){ $e "\e[23m";}  | жирный/белый             |                       | .....          | белый      | белый            |
# MARK(){ $e "\e[  m";}  | ............             |                       | .....          | .....      | .....            |
# MARK(){ $e "\e[30m";}  | жирный/светло-серый      |                       | .....          | серый      |                  |
# MARK(){ $e "\e[31m";}  | жирный/светло-красный    |                       | .....          | красный    |                  |
# MARK(){ $e "\e[32m";}  | жирный/светло-зелёный    |                       | .....          | зелёный    |                  |
# MARK(){ $e "\e[33m";}  | жирный/светло-коричневый |                       | .....          | коричневый |                  |
# MARK(){ $e "\e[34m";}  | жирный/светло-синий      |                       | .....          | синий      |                  |
# MARK(){ $e "\e[35m";}  | жирный/светло-сиреневый  |                       | .....          | сиреневый  |                  |
# MARK(){ $e "\e[36m";}  | жирный/светло-голубой    |                       | .....          | голубой    |                  |
# MARK(){ $e "\e[37m";}  | жирный/белый             |                       | .....          | серый      |                  |
# MARK(){ $e "\e[38m";}  | ............             |                       | .....          | белый      |                  |
# MARK(){ $e "\e[39m";}  | ............             |                       | .....          | .....      |                  |
# MARK(){ $e "\e[40m";}  | ............             | чёрный                | .....          | .....      | чёрный           |
# MARK(){ $e "\e[41m";}  | ............             | красный               | .....          | .....      | красный          |
# MARK(){ $e "\e[42m";}  | ............             | зелёный               | .....          | .....      | зелёный          |
# MARK(){ $e "\e[43m";}  | ............             | коричневый            | .....          | .....      | коричневый       |
# MARK(){ $e "\e[44m";}  | ............             | синий                 | .....          | .....      | синий            |
# MARK(){ $e "\e[45m";}  | ............             | сиреневый             | .....          | .....      | сиреневый        |
# MARK(){ $e "\e[46m";}  | ............             | голубой               | .....          | .....      | голубой          |
# MARK(){ $e "\e[47m";}  | ............             | серый                 | .....          | .....      | серый            |
# MARK(){ $e "\e[48m";}  | ............             |                       | .....          | .....      |                  |
# MARK(){ $e "\e[  m";}  |                          |                       |                |            |                  |
# MARK(){ $e "\e[52m";}  | ............             |                       | .....          | .....      |                  |
# MARK(){ $e "\e[53m";}  | ............             | верхняя черта         | .....          | .....      | верхняя черта    |
# MARK(){ $e "\e[54m";}  | ............             |                       | .....          | .....      |                  |
# MARK(){ $e "\e[  m";}  |                          |                       |                |            |                  |
# MARK(){ $e "\e[89m";}  | ............             |                       | .....          | .....      |                  |
# MARK(){ $e "\e[90m";}  | жирный/серый             |                       | .....          | серый      |                  |
# MARK(){ $e "\e[91m";}  | жирный/розовый           |                       | .....          | розовый    |                  |
# MARK(){ $e "\e[92m";}  | жирный/зелёный           |                       | .....          | зелёный    |                  |
# MARK(){ $e "\e[93m";}  | жирный/жёлтый            |                       | .....          | жёлтый     |                  |
# MARK(){ $e "\e[94m";}  | жирный/синий             |                       | .....          | синий      |                  |
# MARK(){ $e "\e[95m";}  | жирный/сиреневый         |                       | .....          | сиреневый  |                  |
# MARK(){ $e "\e[96m";}  | жирный/голубой           |                       | .....          | голубой    |                  |
# MARK(){ $e "\e[97m";}  | жирный/белый             |                       | .....          |            |                  |
# MARK(){ $e "\e[98m";}  | ............             |                       | .....          |            |                  |
# MARK(){ $e "\e[99m";}  | ............             |                       | .....          |            |                  |
# MARK(){ $e "\e[100m";} | ............             |                       | .....          |            | серый            |
# MARK(){ $e "\e[101m";} | ............             |                       | .....          |            | розовый          |
# MARK(){ $e "\e[102m";} | ............             |                       | .....          |            | светло-зелёный   |
# MARK(){ $e "\e[103m";} | ............             |                       | .....          |            | светло-жёлтый    |
# MARK(){ $e "\e[104m";} | ............             |                       | .....          |            | светло-синий     |
# MARK(){ $e "\e[105m";} | ............             |                       | .....          |            | светло-сиреневый |
# MARK(){ $e "\e[106m";} | ............             |                       | .....          |            | голубой          |
# MARK(){ $e "\e[107m";} | ............             |                       | .....          |            | белый            |
# MARK(){ $e "\e[108m";} | ............             |                       | .....          |            |                  |
# MARK(){ $e "\e[   m";} |                          |                       |                |            |                  |
# MARK(){ $e "\e[127m";} | ............             |                       | .....          |            |                  |
#~~~~~~~~~~~~~~~~~~~~~~~~+~~~~~~~~~~~~~~~~~~~~~~~~~~+~~~~~~~~~~~~~~~~~~~~~~~+~~~~~~~~~~~~~~~~+~~~~~~~~~~~~+~~~~~~~~~~~~~~~~~~+
# цвет и вид текста меню 0 позволяет делать видимой тень курсора
 UNMARK(){ $e "\e[0m";}
# цвет и вид фона меню
      R(){ CLEAR ;stty sane;$e "\ec\e[37;1m\e[J";};
   HEAD(){ DRAW
# Цикл боковых элементов
 for each in $(seq 1 8);
  do
   $E "x                                     x"
  done
#
 WRITE;MARK;TPUT 7 2
   $E "  Up \xE2\x86\x91 \xE2\x86\x93 Down Select Enter           ";
 WRITE;MARK;TPUT 8 2
   $E "  Grannik | 2021.06.30 | 🄯           ";
 WRITE;MARK;TPUT 1 2
   $E "  ПРИМЕР ЦВЕТОВЫХ ВАРИАЦИЙ TPUT МЕНЮ ";UNMARK;}
#
 i=0; CLEAR; CIVIS;NULL=/dev/null
#
 ARROW(){ read -s -n3 key 2>/dev/null >&2
           if [[ $key = $ESC[A ]];then echo up;fi
           if [[ $key = $ESC[B ]];then echo dn;fi;}
#M0(){ TPUT отступ сверху отступ слева; $e "текст";}
 M0(){ TPUT  3 3; $e " Show text                        ";}
 M1(){ TPUT  4 3; $e " Show script                      ";}
 M2(){ TPUT  5 3; $e " Exit                             ";}
# Количество прохождения ступеней
LM=2
   MENU(){ for each in $(seq 0 $LM);do M${each};done;}
    POS(){ if [[ $cur == up ]];then ((i--));fi
           if [[ $cur == dn ]];then ((i++));fi
           if [[ $i -lt 0   ]];then i=$LM;fi
           if [[ $i -gt $LM ]];then i=0;fi;}
REFRESH(){ after=$((i+1)); before=$((i-1))
           if [[ $before -lt 0  ]];then before=$LM;fi
           if [[ $after -gt $LM ]];then after=0;fi
           if [[ $j -lt $i      ]];then UNMARK;M$before;else UNMARK;M$after;fi
           if [[ $after -eq 0 ]] || [ $before -eq $LM ];then
           UNMARK; M$before; M$after;fi;j=$i;UNMARK;M$before;M$after;}
# Инициировать переменные
 INIT(){ R;HEAD;MENU;}
   SC(){ REFRESH;MARK;$S;$b;cur=`ARROW`;}
   ES(){ MARK;$e "Enter = main menu ";$b;read;INIT;};INIT
 while [[ "$O" != " " ]]; do case $i in
   0) S=M0;SC;if [[ $cur == "" ]];then R;echo " Текст показан ";ES;fi;;
   1) S=M1;SC;if [[ $cur == "" ]];then R;cat tputExampleColor.sh;ES;fi;;
   2) S=M2;SC;if [[ $cur == "" ]];then R;exit 0;fi;;
 esac;POS;done
